class Reply < ActiveRecord::Base
  LIST = [["我想装修86.75平方的房子，价格大约是3万元左右，风格自然 简约大方实用就可以了，我的QQ号是853679009拜托","9:58:59"],
    ["我想装修70多平的,价格在2万左右.谢谢帮忙.QQ345085888","19:49:57"],["使用面积60平 想花5万QQ656649971 谢谢谢谢","10:07:43"],
    ["房子在浦东金桥，80平两室一厅，价格在5-6万之间，QQ286389455联系我","13:26:20"],
    ["我家婚房，希望在2个半月内弄好，87个平方，6万，我的QQ99638180","10:02:03"],
    ["请问能帮我设计52平，两室一厅吗？QQ441422712","20:19:22"],
    ["请问哪位帮我设计一套80平米，两室一厅，简约大方，价格3万左右，我的球球号451615240","19:23:35"],
    ["80平方两室一厅带客楼装修，风格自然清新，简约大方，费用在8万以下，QQ：23826982请与我联系","12:19:52"],
    ["82平米2室2厅装修在4W块左右的装修，怎么搞大家帮帮忙Q136042206 拜托","00:30:58"],
    ["请问哪位可以帮我说下75平米 两室一厅（但厅小）风格自然 简约大方 价格在5万左右 我的QQ137107444","21:02:14"],
    ["我要装修86平米的做婚房 请你们帮帮忙啊 先谢谢了啊 要简约大方点的 我的QQ1247887730 价格在6万左右的","07:01:47"],
    ["我要装修60平的，QQ80349865","12:20:00"],
    ["86平米的两房一厅，，我现在把厨房改了，重新装修，，想装现在简约风格，，QQ273562991，价格在3到4万。谁可以帮我设计下","03:22:35"],
    ["新手上路，房子11楼东户 户型3室2厅一卫 带阁楼 漏天大阳台 怎么装修 谢谢 QQ229463034 欢迎老师指导","16:23:17"],
    ["请问哪位可以帮我设计一套80平米，两室一厅，风格自然清新，简约大方，价格在3万元左右！我的qq号7892847","06:47:27"],
    ["65平米的装修，QQ632822943","02:59:18"],
    ["95平米电梯楼实际面积79平米的2室2厅装修在4W块左右的装修，怎么搞大家帮帮忙Q814418179","01:23:01"],
    ["65平米的，我也要装修了，QQ382119291","15:26:07"],
    ["我要装修70米的 QQ754497348 价格在3万以内","12:14:04"],
    ["81平米的两房两厅两卫，想要简单，清新，自然的风格。QQ：36470362 请拜托各位师傅指点迷津，不胜感激！","18:15:19"],
    ["要装房子 了，65平米的，二室一厅，准备装现代简约风格。我的QQ是：370091473 非诚勿扰！！！","15:50:22"],
    ["谁可以帮我 设计下 84平米的 房子 两室一厅 我的QQ 153341191 5万元左右。 必有重谢","18:48:29"],
    ["请问，谁可以帮我设计一下70平的房子 两房一厅 风格就要简约时尚的 谢谢！费用在30000左右的！我的QQ:296205944","16:16:57"],
    ["可以问问这位设计师，很不错~http://wb.51hejia.com/q/281348.html","11:13:09"],
    ["谁可以帮我设计一下100cm2客厅跟主卧,次卧的格局...风格简约时尚~我的QQ是406619167!! 谢谢 ^^//","02:21:25"],
    ["87平方的两房两厅顶层，上面还有一个阁楼。阁楼只有50平米并有斜面，楼高2米1的样子，斜面0.5米。怎样设计？","13:28:27"],
    ["请问，谁可以帮我设计一下73平的房子 两房一厅 风格就要简约时尚的 谢谢！费用在30000左右的！我的QQ:509951777","15:57:45"],
    ["有一30-40平米的平房，想把它隔断开，有卧室、客厅、还有个小书房，看着不要太拥挤，门窗都在南面，屋外屋檐宽约两米，QQ504792657","09:30:13"],
    ["请问谁可以帮我设计一个长13米,宽4米(13米采光)只可两头4米采光的房型,复式的,如可一层两房最好,一层一房一厅也可,QQ372901385","10:53:05"],
    ["谁能帮我设计一个78平米，两室一厅【三个卧室】的房子，主要以温馨为主，尽量便宜点，我的QQ是1120901913，谢谢","21:55:15"],
    ["谁可以帮我设计一下使用面积55平米的老房子,旧房改造,经济实惠一些谢谢我qq313173062","20:23:51"],
    ["谁能帮我设计一个73平米，两室一厅【三个卧室】的房子，主要以温馨为主，尽量便宜点，我的QQ是571622564，谢谢","16:22:00"],
    ["谁帮我设计一下建筑面积60 实用44的房 主要是温馨的那种感觉，钱不要太多，但是需要出视觉的东西可以贵，我QQ641565899 谁可以的话联系我","19:26:02"]
  ]
  acts_as_readonlyable [:read_only_51hejia]


  class << self

    def replies(area_id, type_id, entity_id, limit = nil)
      self.find(:all, :select => "id, user_id, guest_email, ip, content, created_at",
        :conditions => ["area_id = ? and type_id = ? and entity_id = ? and is_delete = 0",
          area_id, type_id, entity_id], :order => "created_at DESC", :limit => limit)
    end

    def save(area_id, type_id, entity_id, user_id, guest_email, ip, content, entity_summary="")
      reply = Reply.new
      reply.area_id = area_id
      reply.type_id = type_id
      reply.entity_id = entity_id
      reply.user_id = user_id
      reply.guest_email = guest_email
      reply.ip = ip
      reply.is_delete = -1
      reply.content = content
      reply.entity_summary = entity_summary
      reply.created_at = Time.now.to_s(:db)
      reply.save
    end
  
  end



end